import type { LyricLine } from "../utils/parseLrc";

export const lyricsMap: Record<string, LyricLine[]> = {
  "26211236": [
    {
      "time": 2,
      "text": "作词 : 三浦徳子"
    },
    {
      "time": 2,
      "text": "作曲 : 八神純子"
    },
    {
      "time": 3,
      "text": "みずいろの雨"
    },
    {
      "time": 5,
      "text": "八神純子"
    },
    {
      "time": 7.78,
      "text": "ああ みずいろの雨"
    },
    {
      "time": 7.78,
      "text": "啊 淡蓝色的雨"
    },
    {
      "time": 13.82,
      "text": "私の肩を抱いてつつんで降り続くの"
    },
    {
      "time": 13.82,
      "text": "淅沥沥地下 拥抱着我的肩 包裹着我"
    },
    {
      "time": 22.99,
      "text": "ああ くずれてしまえ"
    },
    {
      "time": 22.99,
      "text": "啊 击碎在肩头（的雨滴）"
    },
    {
      "time": 28.95,
      "text": "あとかたもなく流されてゆく爱のかたち"
    },
    {
      "time": 28.95,
      "text": "缓缓流下 了无踪迹 这就是爱的模样"
    },
    {
      "time": 38.16,
      "text": "やさしい人ね あなたって人は"
    },
    {
      "time": 38.16,
      "text": "对你那样温柔的人 视如不见"
    },
    {
      "time": 46.16,
      "text": "见ないふりしていたの 私のあやまち"
    },
    {
      "time": 46.16,
      "text": "是我犯的错"
    },
    {
      "time": 53.74,
      "text": "ひとときの気まぐれ 通りすぎるまで"
    },
    {
      "time": 53.74,
      "text": "一时的心血来潮 如今已成往事"
    },
    {
      "time": 61.1,
      "text": "忘れてよ 忘れてよ 爱したことなど"
    },
    {
      "time": 61.1,
      "text": "爱这种东西 还是忘了它吧 忘了它吧"
    },
    {
      "time": 70.35,
      "text": "ああ みずいろの雨"
    },
    {
      "time": 70.35,
      "text": "啊 淡蓝色的雨"
    },
    {
      "time": 76.44,
      "text": "私の肩を抱いてつつんで 降り続くの"
    },
    {
      "time": 76.44,
      "text": "淅沥沥地下 拥抱着我的肩"
    },
    {
      "time": 85.7,
      "text": "ああ 忘れてしまえ"
    },
    {
      "time": 85.7,
      "text": "啊 将它忘却吧"
    },
    {
      "time": 91.81,
      "text": "あとかたもなく流されてゆく 爱のかたち"
    },
    {
      "time": 91.81,
      "text": "缓缓流下 了无踪迹 这就是爱的模样"
    },
    {
      "time": 104.69,
      "text": "とがめる言叶なら素直に闻けたわ"
    },
    {
      "time": 104.69,
      "text": "多想天真地听着 你责怪的话语"
    },
    {
      "time": 112.7,
      "text": "ほほえんでいただけのなつかしい日々"
    },
    {
      "time": 112.7,
      "text": "只因那些微笑着的令人怀念的日子"
    },
    {
      "time": 120.05,
      "text": "伤ついたその分 淋しい目をしてた"
    },
    {
      "time": 120.05,
      "text": "孤独地凝视 那份愈深的伤痛"
    },
    {
      "time": 127.85,
      "text": "もどれない もどれない あの日の二人には"
    },
    {
      "time": 127.85,
      "text": "再也回不到 再也回不到 两个人的从前"
    },
    {
      "time": 137.15,
      "text": "ああ みずいろの雨"
    },
    {
      "time": 137.15,
      "text": "啊 淡蓝色的雨"
    },
    {
      "time": 143.15,
      "text": "私の肩を抱いてつつんで降り続くの"
    },
    {
      "time": 143.15,
      "text": "淅沥沥地下 拥抱着我的肩 包裹着我"
    },
    {
      "time": 152.41,
      "text": "ああ くずれてしまえ"
    },
    {
      "time": 152.41,
      "text": "啊 击碎在肩头（的雨滴）"
    },
    {
      "time": 158.41,
      "text": "あとかたもなく流されてゆく爱のかたち"
    },
    {
      "time": 158.41,
      "text": "缓缓流下 了无踪迹 这就是爱的模样"
    }
  ],
  "864433778": [
    {
      "time": 2,
      "text": "作词 : 小森茂生"
    },
    {
      "time": 2,
      "text": "作曲 : 目黒将司"
    },
    {
      "time": 3,
      "text": "编曲 : tofubeats"
    },
    {
      "time": 4.584,
      "text": "星と僕らと"
    },
    {
      "time": 7.275,
      "text": "黒目将司/TOFUBEATS"
    },
    {
      "time": 10.488,
      "text": "終わらない日々　居場所を無くして"
    },
    {
      "time": 10.488,
      "text": "一如往常的日子，没有栖身之处"
    },
    {
      "time": 20.701999999999998,
      "text": "僕らは彷徨ってた"
    },
    {
      "time": 20.701999999999998,
      "text": "我们在彷徨着"
    },
    {
      "time": 29.766,
      "text": "ミラーに映る　昨日の街並み"
    },
    {
      "time": 29.766,
      "text": "昨天的街道  映照着未来"
    },
    {
      "time": 39.797,
      "text": "絡みつく過去の欠片繋いでみても"
    },
    {
      "time": 39.797,
      "text": "即使与过去的碎片紧紧关联着"
    },
    {
      "time": 47.66,
      "text": "どれだけすくっても"
    },
    {
      "time": 47.66,
      "text": "无论怎样的救赎"
    },
    {
      "time": 51.317,
      "text": "指の間から零れる砂のよう"
    },
    {
      "time": 51.317,
      "text": "也如指尖流沙"
    },
    {
      "time": 57.195,
      "text": "それでも目に見えてるものだけが全てじゃない"
    },
    {
      "time": 57.195,
      "text": "即使这样 眼睛所能看见的也并非全部"
    },
    {
      "time": 64.274,
      "text": "It's in my heart"
    },
    {
      "time": 64.274,
      "text": "它在我心中"
    },
    {
      "time": 66.808,
      "text": "探そう　心で"
    },
    {
      "time": 66.808,
      "text": "寻找吧 在心里"
    },
    {
      "time": 76.343,
      "text": "明日を　ここから"
    },
    {
      "time": 76.343,
      "text": "明天 现在开始"
    },
    {
      "time": 105.887,
      "text": "いつでもどこでも望めば会えるよ"
    },
    {
      "time": 105.887,
      "text": "无论何时 无论何处 只要期待 就能相见"
    },
    {
      "time": 114.664,
      "text": "約束はいらない　僕らこれからも"
    },
    {
      "time": 114.664,
      "text": "不需约定 我们从此"
    },
    {
      "time": 124.904,
      "text": "同じ星見ている　離れていたって"
    },
    {
      "time": 124.904,
      "text": "在同一片星空下 分别着"
    },
    {
      "time": 133.29,
      "text": "だから今日さよなら"
    },
    {
      "time": 133.29,
      "text": "所以 今天 永别了"
    },
    {
      "time": 143.817,
      "text": "どれだけすくっても"
    },
    {
      "time": 143.817,
      "text": "无论怎样的救赎"
    },
    {
      "time": 147.239,
      "text": "指の間から零れる砂のよう"
    },
    {
      "time": 147.239,
      "text": "也如指尖流沙"
    },
    {
      "time": 153.143,
      "text": "それでも目に見えてるものだけが全てじゃない"
    },
    {
      "time": 153.143,
      "text": "即使这样 眼睛所能看见的也并非全部"
    },
    {
      "time": 160.248,
      "text": "It's in my heart"
    },
    {
      "time": 160.248,
      "text": "它在我心中"
    },
    {
      "time": 162.73,
      "text": "世間はここにある物だけが全てと言うけど"
    },
    {
      "time": 162.73,
      "text": "世间所有之物都在其中"
    },
    {
      "time": 169.835,
      "text": "始まりも終わりも"
    },
    {
      "time": 169.835,
      "text": "开始也是 结束也是"
    },
    {
      "time": 175.06,
      "text": "誰にも指図をされずに決めていい"
    },
    {
      "time": 175.06,
      "text": "不用遵循何人的指示决定就好"
    },
    {
      "time": 179.631,
      "text": "I will follow my heart"
    },
    {
      "time": 179.631,
      "text": "我将循我本心"
    },
    {
      "time": 183.184,
      "text": "探そう　未来を"
    },
    {
      "time": 183.184,
      "text": "寻找 未来"
    }
  ],
  "1835122771": [
    {
      "time": 0,
      "text": "作词 : 宇多田ヒカル"
    },
    {
      "time": 3,
      "text": "作曲 : 宇多田ヒカル"
    },
    {
      "time": 6,
      "text": "编曲 : 宇多田ヒカル/A. G. Cook"
    },
    {
      "time": 9,
      "text": "One Last Kiss"
    },
    {
      "time": 12,
      "text": "宇多田ヒカル"
    },
    {
      "time": 21.47,
      "text": "初めてのルーブルは"
    },
    {
      "time": 21.47,
      "text": "第一次去卢浮宫时"
    },
    {
      "time": 23.85,
      "text": "なんてことはなかったわ"
    },
    {
      "time": 23.85,
      "text": "并没有什么特别的感觉"
    },
    {
      "time": 26,
      "text": "私だけのモナリザ"
    },
    {
      "time": 26,
      "text": "因为独属于我的蒙娜丽莎"
    },
    {
      "time": 28.21,
      "text": "もうとっくに出会ってたから"
    },
    {
      "time": 28.21,
      "text": "我早已遇见"
    },
    {
      "time": 30.28,
      "text": "初めてあなたを見た"
    },
    {
      "time": 30.28,
      "text": "初次遇见你的那天"
    },
    {
      "time": 32.38,
      "text": "あの日動き出した歯車"
    },
    {
      "time": 32.38,
      "text": "齿轮开始转动"
    },
    {
      "time": 34.57,
      "text": "止められない喪失の予感"
    },
    {
      "time": 34.57,
      "text": "无法停止那将要失去什么的预感"
    },
    {
      "time": 38.96,
      "text": "もういっぱいあるけれど"
    },
    {
      "time": 38.96,
      "text": "虽说已经有很多次了"
    },
    {
      "time": 44.76,
      "text": "もう一つ増やしましょう"
    },
    {
      "time": 44.76,
      "text": "让我们再来一个吻吧"
    },
    {
      "time": 48.96,
      "text": "(Can you give me one last kiss？)"
    },
    {
      "time": 48.96,
      "text": "是否可以给我一个最后的吻"
    },
    {
      "time": 53.31,
      "text": "忘れたくないこと"
    },
    {
      "time": 53.31,
      "text": "不想遗忘之事"
    },
    {
      "time": 55.88,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 55.88,
      "text": "Oh oh oh oh oh"
    },
    {
      "time": 61.95,
      "text": "忘れたくないこと"
    },
    {
      "time": 61.95,
      "text": "不愿遗忘之事"
    },
    {
      "time": 64.5,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 64.5,
      "text": "Oh oh oh oh oh"
    },
    {
      "time": 70.63,
      "text": "I love you more than you'll ever know"
    },
    {
      "time": 70.63,
      "text": "我比你所想象的还要更加爱你"
    },
    {
      "time": 81.6,
      "text": "「写真は苦手なんだ」"
    },
    {
      "time": 81.6,
      "text": "\"我不擅长拍照\""
    },
    {
      "time": 83.64,
      "text": "でもそんなものはいらないわ"
    },
    {
      "time": 83.64,
      "text": "但那种事情其实无关紧要"
    },
    {
      "time": 85.91,
      "text": "あなたが焼きついたまま"
    },
    {
      "time": 85.91,
      "text": "你的身影已经烙在"
    },
    {
      "time": 87.97,
      "text": "私の心のプロジェクター"
    },
    {
      "time": 87.97,
      "text": "我心中的放映机里"
    },
    {
      "time": 90.12,
      "text": "寂しくないふりしてた"
    },
    {
      "time": 90.12,
      "text": "都假装着自己并不孤独"
    },
    {
      "time": 92.4,
      "text": "まあ、そんなのお互い様か"
    },
    {
      "time": 92.4,
      "text": "嘛，我们就是那样"
    },
    {
      "time": 94.44,
      "text": "誰かを求めることは"
    },
    {
      "time": 94.44,
      "text": "如果谁去找了对方"
    },
    {
      "time": 96.53,
      "text": "即ち傷つくことだった"
    },
    {
      "time": 96.53,
      "text": "就会徒增伤痕"
    },
    {
      "time": 98.67,
      "text": "Oh, can you give me one last kiss？"
    },
    {
      "time": 98.67,
      "text": "是否可以给我一个最后的吻"
    },
    {
      "time": 104.74,
      "text": "燃えるようなキスをしよう"
    },
    {
      "time": 104.74,
      "text": "来一个火热的吻吧"
    },
    {
      "time": 108.95,
      "text": "忘れたくても"
    },
    {
      "time": 108.95,
      "text": "火热到即使想忘"
    },
    {
      "time": 113.42,
      "text": "忘れられないほど"
    },
    {
      "time": 113.42,
      "text": "也难以忘怀"
    },
    {
      "time": 115.92,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 115.92,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 122.02,
      "text": "I love you more than you'll ever know"
    },
    {
      "time": 122.02,
      "text": "我比你所想象的还要更加爱你"
    },
    {
      "time": 124.74,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 124.74,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 130.44,
      "text": "I love you more than you'll ever know"
    },
    {
      "time": 130.44,
      "text": "我比你所想象的还要更加爱你"
    },
    {
      "time": 150.23,
      "text": "もう分かっているよ"
    },
    {
      "time": 150.23,
      "text": "我已经明白了"
    },
    {
      "time": 155.82,
      "text": "この世の終わりでも"
    },
    {
      "time": 155.82,
      "text": "就算这个世界走向终结"
    },
    {
      "time": 160.21,
      "text": "年をとっても"
    },
    {
      "time": 160.21,
      "text": "就算年龄渐长"
    },
    {
      "time": 166.99,
      "text": "忘れられない人"
    },
    {
      "time": 166.99,
      "text": "你也是我无法忘记的人"
    },
    {
      "time": 169.34,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 169.34,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 171.35,
      "text": "忘れられない人"
    },
    {
      "time": 171.35,
      "text": "无法忘记的人"
    },
    {
      "time": 173.3,
      "text": "忘れられない人"
    },
    {
      "time": 173.3,
      "text": "无法忘记的人"
    },
    {
      "time": 175.65,
      "text": "忘れられない人"
    },
    {
      "time": 175.65,
      "text": "无法忘记的人"
    },
    {
      "time": 179.89,
      "text": "忘れられない人"
    },
    {
      "time": 179.89,
      "text": "无法忘记的人"
    },
    {
      "time": 181.57,
      "text": "I love you more than you'll ever know"
    },
    {
      "time": 181.57,
      "text": "我比你所想象的还要更加爱你"
    },
    {
      "time": 183.2,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 183.2,
      "text": "Oh oh oh oh oh…"
    },
    {
      "time": 184.35,
      "text": "忘れられない人"
    },
    {
      "time": 184.35,
      "text": "无法忘记的人"
    },
    {
      "time": 188.25,
      "text": "忘れられない人"
    },
    {
      "time": 188.25,
      "text": "无法忘记的人"
    },
    {
      "time": 190.65,
      "text": "忘れられない人"
    },
    {
      "time": 190.65,
      "text": "无法忘记的人"
    },
    {
      "time": 192.85,
      "text": "忘れられない人"
    },
    {
      "time": 192.85,
      "text": "无法忘记的人"
    },
    {
      "time": 197.11,
      "text": "忘れられない人"
    },
    {
      "time": 197.11,
      "text": "无法忘记的人"
    },
    {
      "time": 199.1,
      "text": "I love you more than you'll ever know"
    },
    {
      "time": 199.1,
      "text": "我比你所想象的还要更加爱你"
    },
    {
      "time": 201.68,
      "text": "忘れられない"
    },
    {
      "time": 201.68,
      "text": "无法忘记的"
    },
    {
      "time": 203.8,
      "text": "忘れられない"
    },
    {
      "time": 203.8,
      "text": "无法忘记的"
    },
    {
      "time": 205.2,
      "text": "忘れられない"
    },
    {
      "time": 205.2,
      "text": "无法忘记的"
    },
    {
      "time": 207.39,
      "text": "忘れられない人"
    },
    {
      "time": 207.39,
      "text": "无法忘记的人"
    },
    {
      "time": 209.55,
      "text": "忘れられない"
    },
    {
      "time": 209.55,
      "text": "无法忘记的"
    },
    {
      "time": 211.63,
      "text": "忘れられない"
    },
    {
      "time": 211.63,
      "text": "无法忘记的"
    },
    {
      "time": 213.84,
      "text": "忘れられない人"
    },
    {
      "time": 213.84,
      "text": "无法忘记的人"
    },
    {
      "time": 215.96,
      "text": "I love you more than you'll ever know"
    },
    {
      "time": 215.96,
      "text": "我比你所想象的还要更加爱你"
    },
    {
      "time": 227.6,
      "text": "吹いていった風の後を"
    },
    {
      "time": 227.6,
      "text": "可曾记得 追寻着流风的"
    },
    {
      "time": 231.29,
      "text": "追いかけた　眩しい午後"
    },
    {
      "time": 231.29,
      "text": "那个明媚晃眼的午后"
    }
  ]
};
